<template>
  <div class="rules-container">
    <h1 class="page-header">
      Fantasy Football Legends Rules
    </h1>
    <vs-collapse type="border">
      <vs-collapse-item v-for="(section, i) in Object.keys(rules)" :key="i">
        <div slot="header">{{ section }}</div>
        <p
          v-for="(sectionParagraph, i) in rules[section]"
          :key="i"
          class="section-paragraph"
        >
          <img
            :src="`${sectionParagraph}`"
            alt=""
            v-if="section === 'Scoring' && i === 0"
          />
          {{ sectionParagraph }}
          <vs-divider />
        </p>
      </vs-collapse-item>
    </vs-collapse>
  </div>
</template>

<script>
export default {
  name: "RulesAndPrizes",
  data() {
    return {
      rules: {
        "General Rules": [
          "Достъпни за избор са играчи от 8-те топ първенства със сходни програми за сезона - Англия, Испания, Италия, Франция (по 38 кръга), Германия, Португалия, Холандия, Турция (по 34 кръга);",
          "В играта няма бюджети и цени на играчите. Избирането на играчи става на draft принцип;",
          "Сорсът за статистики и точки е WhoScored.com (десктоп версията), а за играчи и позициите им – TransferMarkt.com. Имайте предвид, че позициите на играчите се ъпдейтват постоянно в зависимост от това къде биват пускани от треньора. При трансфер се гледа моментната позиция на играча, а не тази, с която е започнал сезона. (Пример: Яго Аспас е взет на драфта като крило за Отбор А. Играе 20 кръга и точкуването му е за крило. След Кръг 20 Аспас е продаден от Отбор А и Отбор Б иска да го купи. Да, но според ТрансферМаркт той вече е нападател и ако Отбор Б го иска, може да го вземе само като такъв)",
          "Същото е с WhoScored – наградите за МОМ понякога биват сменяни след някой и друг ден. Ние можем да проследим промените само ако се случат преди да извадим точките за кръга. След тяхното обявяване промени не може да има.",
          "Сезонът ще се проведе в 43 седмици/кръга. За точкуването в един кръг се вземат предвид всички получени точки в периода Вторник-Понеделник (вкл); ",
          "Първият кръг започва във Вторник 30.07.2019, а последният завършва в Неделя 24.05.2020; Драфтът ще се проведе в седмицата преди първи кръг, в удобно за всички участници време;",
          "Входна такса за мениджър - 50лв. Допуска се разсрочено плащане. Награден фонд за всяка група",
          "- 1 място – 200лв.",
          "- 2 място – 100лв.",
          "- 3 място – 50лв.",
          "Победителят в Купата получава и 100лв."
        ],
        "Teams & Players": [
          "Мениджърите ще бъдат разпределени в две независими групи – лига Пеле и лига Марадона. Всяка лига ще има по 10 отбора и отделен драфт.",
          "Всеки тим се състои от 16 играчи (1 вратар, 2 леви бека, 2 десни бека, 2 централни защитника, 2 леви крила, 2 десни крила, 2 централни халфа и 3 нападатели). Всички играчи участват в точкуването за кръга (няма резерви);",
          "Играчи не могат да бъдат дублирани (веднъж избран, даден играч може да съществува само в 1 отбор, докато мениджърът не реши да го трансферира извън клуба);",
          "Всеки отбор има капитан, който удвоява точките си за кръга. Капитанът може да се сменя веднъж на кръг и смяната влиза в сила за следващия календарен кръг;",
          "Всеки отбор има и вицекапитан, който се активира ако капитанът не запише и една игрова минута. При седмица с 2 футболни кръга, вицекапитанът се активира само ако капитанът, не запише и една минута и в двата мача.",
          "Веднъж за полусезон може да се селектира троен капитан - той утроява точките си за кръга. Селекцията му се обявява за следващия календарен кръг;"
        ],
        Scoring: [
          "http://ff-legends.com/rules_s3.PNG",
          "За точки “starter” се класират играчи, които са изиграли поне 60 минути",
          "За точки “sub” се класират играчи, които не са започнали титуляри или са изиграли по-малко от 60мин. Ако играч влезне като принудителна смяна и изиграе поне 60мин се класира за точки “starter”",
          "Играчът трябва да изиграе поне 45мин, за да се класира за точки “победа”",
          "За да се класира за точки “clean sheet” играчът трябва да изиграе поне 45мин, в който период тимът му да не допусне гол (не се броят получените голове във времето, когато играчът не е на терена)",
          "Аналогично, за да бъдат отнети точки за “3 allowed”, играчът трябва да е бил на терена поне 45мин и головете да са получени, докато той е на терена.",
          "За определяне на saves за точките „GK saves x5” се гледат ударите on target на противниковия отбор в WhoScored.",
          "При match rating над 8.5 се дава допълнителна точка, независимо от позицията на играча.",
          "Ако играч получи жълт картон или червен картон, докато е на скамейката, той ще получи съответните си -1 и -3 точки, въпреки че не е влезнал в игра."
        ],
        Transfers: [
          "Позволен е един (1) трансфер на рунд. Трансферите се заявяват до Понеделник и важат за следващата седмица;",
          "При изпускане на трансфера за седмицата се позволяване натрупване до +1 трансфер. Така на следващата седмица ще имате 2 трансфера, но ако изпуснете и нея, на по-следващата ще имате отново 2 трансфера;",
          "Трансфери могат да се осъществяват както на “свободни агенти”, така и чрез договорка между двама мениджъри, при условие, че разменените играчи са на една и съща позиция;",
          "По веднъж на полусезон може да използвате transfer wildcard, който ще ви позволи да направите три трансфера накуп;",
          "Ако клуб привлече “свободен агент”, друг мениджър може да привлече освободения от него играч. Ако повече от 1 мениджър желае да привлече освободения играч, предимството е на принципа “first come first served”. Актуални новини и трансфери ще бъдат обявявани на сайта и в затворена фейсбук група;",
          "Ако даден играч в реалния футбол е изходящо трансфериран в някое първенство извън горепосочените осем, то мениджърът му ще има право да го смени, независимо дали вече е използвал трансферът си за седмицата; Това НЕ важи ако играчът е преминал в друг клуб от горепосочените осем първенства."
        ],
        Drafting: [
          "Драфтовете трябва да се проведат преди 02.08, за да може да са финализирани максимално много трансфери в реалния футбол и да се изпревари стартът на най-ранните европейски първенства в играта (Холандия, Англия и Франция);",
          "Времетраенето на драфтовете зависи изцяло от участниците, но предвид обема на играчите (160 футболисти) и възможността последните драфт pick-ове да са малко по-трудни се очаква да си освободите около 2 часа;",
          "Силно е препоръчително участниците да са предварително подготвени за драфта, защото в хода на жребия много от техните предварителни идеи могат да се окажат “взети” от други участници. Широкото познаване на играчи от 8-те първенства ще ускори целия процес на избор;",
          "За да се избегнат спорове относно позицията на даден играч, информация за това ще бъде вземана от transfermarkt.com; (ВАЖНО - изключение правят Меси, Неймар, Кристиано и Мбаппе, които ще бъдат броени като нападатели независимо какво казва сорса!)",
          "За останалите играчи в TransferMarkt може да гледате:",
          "- GK ",
          "- DL – Left back / Left defender",
          "- DR – Right back / Right defender",
          "- DC – Central defender",
          "- LW – Left winger",
          "- RW – Right winger",
          "- MC – Defensive midfielder, Central Midfielder, Attacking midfielder",
          "- FW – Centre forward, Second Striker",
          "В началото на драфта всеки участник ще получи номер. Ще бъде използван random generator, който ще определи редът на участниците;",
          "Мениджър 1 получава избор 1, Мениджър 2 е с избор 2 и така до избор 10. След като Мениджър 10 вземе избор 10, той взима и избор 11. Аналогично избор 12 е за Мениджърът, който е имал избор 9 и така до Мениджър 1, който получава избор 20 и след това избор 21. Това продължава до избор 160. ",
          "След избор 140 всеки мениджър избира капитанът си за 1 кръг…"
        ],
        "Trofeo Legendarico": [
          "В Купата ще вземат участие всички отбори, независимо от Лигата или класирането си. Единствено там е възможно да се паднат два отбора с еднакви футболисти.",
          "Форматът на Купата е групи + елиминации. 20-те отбора се разделят в 4 групи по 5 и играят всеки срещу всеки в 1 мач. След изиграването на 4-те си мача от всяка група ще продължат първите 2 отбора.",
          "Във фазата на елиминациите ще имаме четвъртфинали, полуфинали и финал, всичките в по два мача.",
          "Отборът за Купата се състои от 6 човека – 1 вратар, 2 защитника, 2 халфа и 1 нападател. На позициите защитник и халф може да ползвате всеки играч от 3те позиции на терена (ляв, централен и десен).",
          "Без резерви и капитани.",
          "Кумулативните точки на 6-те играча срещу 6-те противника определят крайния резултат.",
          "Победителят в Купата получава +100лв, независимо от позицията му в класирането на Лигата.",
          "При равен резултат след двата мача в директните елиминации се гледат повечето точки на чужд терен."
        ]
      }
    };
  }
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="scss">
.rules-container {
  width: 75%;
  padding: 20px;

  .page-header {
    font-weight: bold;
    font-size: 1.5rem;
    width: 100%;
    text-align: center;
    padding: 20px;
    text-decoration: underline;
  }

  .vs-collapse.border {
    border-radius: 10px;
    overflow: hidden;

    .vs-collapse-item--header {
      background-color: #794446 !important;
      font-weight: bold;
      color: #c6c6c6;
    }
  }

  .section-paragraph {
    font-size: 1rem;
    margin: 15px 25px;
    line-height: 22px;
    img {
      width: 60%;
    }
  }
}
</style>